// Данные препаратов
const DRUGS = {
   
    Адреналин:{
name:"Адреналин",synonyms:["эпинефрин","epinephrin","adrenalin"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Эпинефрин; Adrenalini","Ампула 1мг/мл - 1мл","<b>Дозировка введения:</b>","Внутривенно 0.01мг/кг","Эндотрахеально - 0.1мг/кг","<b>Максимальная дозировка:</b>","Разовая – 1мг","<b>Ограничения:</b>","Возрастных ограничений нет"],
table:{5:["Внутривенно 0.05мг-0.05мл","Эндотрахеально 0.5мг-0.5мл"],10:["Внутривенно 0.1мг-0.1мл","Эндотрахеально 1мг-1мл"],15:["Внутривенно 0.15мг-0.15мл"],20:["Внутривенно 0.2мг-0.2мл"],25:["Внутривенно 0.25мг-0.25мл"],30:["Внутривенно 0.3мг-0.3мл"],35:["Внутривенно 0.35мг-0.35мл"],40:["Внутривенно 0.4мг-0.4мл"],45:["Внутривенно 0.45мг-0.45мл"],50:["Внутривенно 0.5мг-0.5мл"],55:["Внутривенно 0.55мг-0.55мл"],60:["Внутривенно 0.6мг-0.6мл"],65:["Внутривенно 0.65мг-0.65мл"],70:["Внутривенно 0.7мг-0.7мл"],}},

    АктивированныйУголь:{
name:"Активированный уголь",synonyms:["уголь"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Carbonis activati","Таблетка-250мг","<b>Дозировка введения:</b>","Внутрь 50 мг/кг","<b>Максимальная дозировка:</b>","Суточная – 200мг/кг","<b>Ограничения:</b>","Возрастных ограничений нет."],
table:{5:["1 таблетка - 250мг"],10:["2 таблетки - 500мг"],15:["3 таблетки - 750мг"],20:["4 таблетки - 1000мг"],25:["5 таблеток - 1250мг"],30:["6 таблеток - 1500мг"],35:["7 таблеток - 1750мг"],40:["8 таблеток - 2000мг"],45:["9 таблеток - 2250мг"],50:["10 таблеток - 2500мг"],55:["11 таблеток - 2750мг"],60:["12 таблеток - 3000мг"],65:["13 таблеток - 3250мг"],70:["14 таблеток - 3500мг"],}},

    Аминофиллин:{
name:"Аминофиллин",synonyms:["Эуфиллин","euphyllin"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Аминофиллин; Euphyllini","Ампула 24мг/мл – 10мл","<b>Дозировка введения:</b>","Внутривенно 3 мг/кг или 0.13мл","<b>Максимальная дозировка:</b>","Суточная - 15мг/кг","<b>Ограничения:</b>","Возрастных ограничений нет"],
table:{5:["15мг-0.6мл"],10:["30мг-1.3мл"],15:["45мг-1.9мл"],20:["60мг-2.5мл"],25:["75мг-3.1мл"],30:["90мг-3.8мл"],35:["105мг-4.4мл"],40:["120мг-5мл"],45:["135мг-5.6мл"],50:["150мг-6.3мл"],55:["165мг-6.9мл"],60:["180мг-7.5мл"],65:["195мг-8.1мл"],70:["210мг-8.8мл"],}},

    Амиодарон:{
name:"Амиодарон",synonyms:["кордарон","Amiodaron"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Амиодарон; Amiodaron","Ампула 50мг/мл – 3мл","<b>Дозировка введения:</b>","Внутривенно 5мг/кг или 0.1мл/кг","<b>Максимальная дозировка:</b>","Разовая – не более 300мг","Суточная – 600мг","<b>Ограничения:</b>","Возрастных ограничений нет"],
table:{5:["Внутривенно 25мг-0.5мл"],10:["Внутривенно 50мг-1мл"],15:["Внутривенно 75мг-1.5мл"],20:["Внутривенно 100мг-2мл"],25:["Внутривенно 125мг-2.5мл"],30:["Внутривенно 150мг-3мл"],35:["Внутривенно 175мг-3.5мл"],40:["Внутривенно 200мг-4мл"],45:["Внутривенно 225мг-4.5мл"],50:["Внутривенно 250мг-5мл"],55:["Внутривенно 275мг-5.5мл"],60:["Внутривенно 300мг-6мл"],65:["Внутривенно 325мг-6.5мл"],70:["Внутривенно 350мг-7мл"],}},

   Аскорбинка:{
name:"Аскорбиновая кислота",synonyms:["аскорбинка"," Acidi ascorbinic"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Аскорбиновая кислота ","Ампула 50 мг/мл-1 мл ","<b>Дозировка введения:</b>","Внутривенно; внутримышечно","5 мг/кг или 0,1 мл/кг ","<b>Максимальная дозировка:</b>","Суточная доза - 500 мг","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["25мг-0.5мл"],10:["50мг-1мл"],15:["75мг-1.5мл"],20:["100мг-2мл"],25:["125мг-2.5мл"],30:["150мг-3мл"],35:["175мг-3.5мл"],40:["200мг-4мл"],45:["225мг-4.5мл"],50:["250мг-5мл"],55:["275мг-5.5мл"],60:["300мг-6мл"],65:["325мг-6.5мл"],70:["350мг-7мл"],}},
   
    Анальгин:{
name:"Анальгин",synonyms:["analgini","метамизол натрия"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Анальгин; Метамизол натрия","Ампула 500мг/мл – 2мл","<b>Дозировка введения:</b>","Внутривенно; внутримышечно","10мг/кг или 0.02мл/кг","<b>Ограничения:</b>","Возрастных ограничений нет"],
table:{5:["50мг-0.1мл"],10:["100мг-0.2мл"],15:["150мг-0.3мл"],20:["200мг-0.4мл"],25:["250мг-0.5мл"],30:["300мг-0.6мл"],35:["350мг-0.7мл"],40:["400мг-0.8мл"],45:["450мг-0.9мл"],50:["500мг-1мл"],55:["550мг-1.1мл"],60:["600мг-1.2мл"],65:["650мг-1.3мл"],70:["700мг-1.4мл"],}},

   Аспирин:{
name:"Аспирин",synonyms:["Ацетилсалициловая кислота","aspirin","Acidi acetylsalicylici"],type:"text",info:[
"<b>Название:</b>","Ацетилсалициловая кислота","Acidi acetylsalicylici","Таблетка-500мг","<b>Дозировка введения:</b>","Внутрь 30мг/кг","<b>Максимальная дозировка:</b>","0.5-1 таблетка на прием","До 6 раз в сутки","<b>Возрастные ограничения:</b>","Разрешено с 16 лет"],},

   Атропин:{
name:"Атропин",synonyms:["atropin"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Атропин; Atropini sulfatis","Ампула 1мг/мл-1мл","<b>Дозировка введения:</b>","Подкожно; в/венно; в/мышечно","0.01мг/кг","0,1мл на каждые 10кг","<b>Максимальная дозировка:</b>","Суточная 3мл - 3мг","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["0.05мг-0.05мл"],10:["0.1мг-0.1мл"],15:["0.15мг-0.15мл"],20:["0.2мг-0.2мл"],25:["0.25мг-0.25мл"],30:["0.3мг-0.3мл"],35:["0.35мг-0.35мл"],40:["0.4мг-0.4мл"],45:["0.45мг-0.45мл"],50:["0.5мг-0.5мл"],55:["0.55мг-0.55мл"],60:["0.6мг-0.6мл"],65:["0.65мг-0.65мл"],70:["0.7мг-0.7мл"],}},

   Будесонид:{
name:"Будесонид",synonyms:["пульмикорт","буденит","pulmicort","budesonid"],type:"text",info:[
"<b>Название:</b>","Будесонид; Пульмикорт","Небула 0.5мг/мл-2мл","<b>Дозировка введения:</b>","Ингаляционно 0.5-1мг","По 1-2 небулы до 2-х раз в день","<b>Максимальная дозировка:</b>","Суточная 2мг","<b>Возрастные ограничения:</b>","Разрешено с 6 месяцев"],},

   Верапамил:{
name:"Верапамил",synonyms:["verapamil"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Верапамил; Verapamil","Ампула 2.5мг/мл-2мл","<b>Дозировка введения:</b>","Внутривенно 0.1мг/кг","0,4мл на каждые 10 кг","<b>Максимальная дозировка:</b>","Суточная 10мг","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["0.5мг-0.2мл"],10:["1мг-0.4мл"],15:["1.5мг-0.6мл"],20:["2мг-0.8мл"],25:["2.5мг-1мл"],30:["3мг-1.2мл"],35:["3.5мг-1.4мл"],40:["4мг-1.6мл"],45:["4.5мг-1.8мл"],50:["5мг-2мл"],55:["5.5мг-2.2мл"],60:["6мг-2.4мл"],65:["6.5мг-2.6мл"],70:["7мг-2.8мл"],}},

   Галантамин:{
name:"Галантамин",synonyms:["Нивалин","galantamin","nivalin"],type:"age",unit:"возраст в годах",steps: [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15],info:["<b>Название:</b>","Галантамин; Нивалин","Ампула 2,5 мг/мл-1 мл","<b>Дозировка введения:</b>","Внутривенно; Подкожно","С 1 года 1мг-0.4мл","3-5 лет 2мг-0.8мл","6-8 лет 3мг-1.2мл","9-11 лет 5мг-2мл","12 лет и старше 5-10мг-2-4мл","<b>Максимальная дозировка:</b>","Суточная доза 10мг-4мл","<b>Возрастные ограничения:</b>","Старше 1 года"],
table:{1:["1мг-0.4мл"],2:["1мг-0.4мл"],3:["2мг-0.8мл"],4:["2мг-0.8мл"],5:["2мг-0.8мл"],6:["3мг-1.2мл"],7:["3мг-1.2мл"],8:["3мг-1.2мл"],9:["5мг-2мл"],10:["5мг-2мл"],11:["5мг-2мл"],12:["5-10мг-2-4мл"],13:["5-10мг-2-4мл"],14:["5-10мг-2-4мл"],15:["5-10мг-2-4мл"],}},

   Галоперидол:{
name:"Галоперидол",synonyms:["Haloperidoli"," Галдол"," Haldol"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Галоперидол","Ампула 5 мг/мл-1 мл","<b>Дозировка введения:</b>","Внутривенно; внутримышечно","0,025 мг/кг или 0,005 мл/кг","<b>Максимальная дозировка:</b>","Суточная доза 0,15 мг/кг","<b>Возрастные ограничения:</b>","Старше 3 лет"],
table:{10:["Разовая 0.25мг-0.05мл","Суточная 1.5мг-0.3мл"],15:["Разовая 0.375мг-0.075мл","Суточная 2.25мг-0.45мл"],20:["Разовая 0.5мг-0.1мл","Суточная 3мг-0,6мл"],25:["Разовая 0.625мг-0.125мл","Суточная 3.75мг-7.5мл"],30:["Разовая 0.75мг-0.15мл","Суточная 4.5мг-0.9мл"],35:["Разовая 0.875мг-0.175мл","Суточная 5.25мг-1.05мл"],40:["Разовая 1мг-0.2мл","Суточная 6мг-1,2мл"],45:["Разовая 1.125мг-0.225мл","Суточная 6.75мг-1.35мл"],50:["Разовая 1.25мг-0.25мл","Суточная 7.5мг-1.5мл"],55:["Разовая 1.375мг-0.275мл","Суточная 8.25мг-1.65мл"],60:["Разовая 1.5мг-0.3мл","Суточная 9мг-1.8мл"],65:["Разовая 1.625мг-0.325мл","Суточная 9.75мг-1.95мл"],70:["Разовая 1.75мг-0.35мл","Суточная 10.5мг-2.1мл"],}},
 
   Гепарин:{
name:"Гепарин",synonyms:["heparini"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Гепарин; Heparini","Ампула 5000МЕ/мл-1мл","<b>Дозировка введения:</b>","Внутривенно; подкожно","75ЕД/кг или 0,015 мл/кг","<b>Максимальная дозировка:</b>","Суточная","1-3 месяца 800ЕД/Кг","4-12 месяцев 700ЕД/кг","Старше 1 года 500ЕД/кг","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["375МЕ-0.07мл"],10:["750МЕ-0.15мл"],15:["1125МЕ-0.22мл"],20:["1500МЕ-0.3мл"],25:["1875МЕ-0.37мл"],30:["2250МЕ-0.45мл"],35:["2625МЕ-0.52мл"],40:["3000МЕ-0.6мл"],45:["3375МЕ-0.67мл"],50:["3750МЕ-0.75мл"],55:["4125МЕ-0.82мл"],60:["4500МЕ-0.9мл"],65:["4875МЕ-0.97мл"],70:["5000МЕ-1мл"],}},

   ГЭК:{
name:"ГЭК 6%",synonyms:["Гидроксиэтилкрахмал","hydroxyethylamyl"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50],info:["<b>Название:</b>","ГЭК 6%","Гидроксиэтилкрахмал","Флакон - 250мл","<b>Дозировка введения:</b>","Инфузионно 10-15мл/кг","Флакон на 20-25 кг","<b>Максимальная дозировка:</b>","Суточная 33мг/кг","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["От 50мл до 75мл"],10:["От 100мл до 150мл"],15:["От 150мл до 225мл"],20:["От 200мл до 300мл"],25:["От 250мл до 375мл"],30:["От 300мл до 450мл"],35:["От 350мл до 525мл"],40:["От 400мл до 600мл"],45:["450мл"],50:["500мл"],}},

   Дексаметазон:{
name:"Дексаметазон",synonyms:["Dexametazoni"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Дексаметазон; Dexametazoni","Ампула 4мг/мл-1мл","<b>Дозировка введения:</b>","Внутривенно; внутримышечно","0,2-1,2 мг/кг","0,05 мл/кг-0,3 мл/кг","<b>Максимальная дозировка:</b>","Суточная 1.2 мг/кг","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["От 1мг-0.25мл (0.2мг/кг)","3мг-0.75мл (0.6 мг/кг)","6мг-1.5мл (1.2мг/кг)"],10:["От 2мг-0.5мл (0.2мг/кг)","6мг-1.5мл (0.6 мг/кг)","12мг-3мл (1.2мг/кг)"],15:["От 3мг-0.75мл (0.2мг/кг)","9мг-2.25мл (0.6 мг/кг)","18мг-4.5мл (1.2мг/кг)"],20:["От 4мг-1мл (0.2мг/кг)","12мг-3мл (0.6 мг/кг)","24мг-6мл (1.2мг/кг)"],25:["От 5мг-1.25мл (0.2мг/кг)","15мг-3.75мл (0.6 мг/кг)","30мг-7.5мл (1.2мг/кг)"],30:["От 6мг-1.5мл (0.2мг/кг)","18мг-4.5мл (0.6 мг/кг)","36мг-9мл (1.2мг/кг)"],35:["От 7мг-1.75мл (0.2мг/кг)","21мг-5.25мл (0.6 мг/кг)"],40:["От 8мг-2мл (0.2мг/кг)","24мг-6мл (0.6 мг/кг)"],45:["От 9мг-2.25мл (0.2мг/кг)","27мг-6.75мл (0.6 мг/кг)"],50:["От 10мг-2.5мл (0.2мг/кг)","30мг-7.5мл (0.6 мг/кг)"],55:["От 11мг-2.75мл (0.2мг/кг)","33мг-8.25мл (0.6 мг/кг)"],60:["От 12мг-3мл (0.2мг/кг)","36мг-9мл (0.6 мг/кг)"],65:["От 13мг-3.25мл (0.2мг/кг)"],70:["От 14мг-3.5мл (0.2мг/кг)"],}},

   Декстроза10:{
name:"Декстроза 10%",synonyms:["Глюкоза","Dextrose","Glucose"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50],info:["<b>Название:</b>","Декстроза 10%; Глюкоза 10%","Флакон - 500мл","<b>Дозировка введения:</b>","Инфузионно 10-20мл/кг","Внутривенно струйно 2мл/кг","<b>Максимальная дозировка:</b>","До 6 г/кг/сут в первые сутки","затем до 15 г/кг/сут","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["Инфузионно 50мл-100мл","Внутривенно струйно 10мл"],10:["Инфузионно 100мл-200мл","Внутривенно струйно 20мл"],15:["Инфузионно 150мл-300мл","Внутривенно струйно 30мл"],20:["Инфузионно 200мл-400мл","Внутривенно струйно 40мл"],25:["Инфузионно 250мл-500мл","Внутривенно струйно 50мл"],30:["Инфузионно 300мл-600мл","Внутривенно струйно 60мл"],35:["Инфузионно 350мл-700мл","Внутривенно струйно 70мл"],40:["Инфузионно 400мл-800мл","Внутривенно струйно 80мл"],45:["Инфузионно 450мл-900мл","Внутривенно струйно 90мл"],50:["Инфузионно 500мл-1000мл","Внутривенно струйно 100мл"],}},

   Декстроза5:{
name:"Декстроза 5%",synonyms:["Глюкоза","Dextrose","Glucose"],type:"weight",unit:"вес в кг",steps:[3,4,5,6,7,8,9,10,11,12,13,14,15,16],info:["<b>Название:</b>","Декстроза 5%; Глюкоза 5%","Флакон - 250мл","<b>Дозировка введения:</b>","Инфузионно; Внутривенно","До 1 года - 2мл/кг в/венно струйно","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{3:["6мл"],4:["8мл"],5:["10мл"],6:["12мл"],7:["14мл"],8:["16мл"],9:["18мл"],10:["20мл"],11:["22мл"],12:["24мл"],13:["26мл"],14:["28мл"],15:["30мл"],16:["32мл"],}},

   Декстроза40:{
name:"Декстроза 40%",synonyms:["Глюкоза","Dextrose","Glucose"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50,55,60,65,70],info:["<b>Название:</b>","Декстроза; Глюкоза","Ампула 40%-10мл","<b>Дозировка введения:</b>","Инфузионно; Внутривенно","От 1 года - 2мл/кг в/венно струйно","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["10мл"],10:["20мл"],15:["30мл"],20:["40мл"],25:["50мл"],30:["60мл"],35:["70мл"],40:["80мл"],45:["90мл"],50:["100мл"],55:["110мл"],60:["120мл"],65:["130мл"],70:["140мл"],}},

   Диазепам:{
name:"Диазепам",synonyms:["Реланиум","Сибазон","diazepami","sibazoni","relanii"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50],info:["<b>Название:</b>","Диазепам; Сибазон; Реланиум","Ампула 5мг/мл-2мл","<b>Дозировка введения:</b>","Внутривенно 0.2-0.5мг/кг","Внутримышечно 0.5мг/кг","<b>Максимальная разовая доза:</b>","До 5 лет - 5мг","До 10 лет - 10мг","В/венно медленно, не менее 2х минут","Повторное введение через 5-15 минут в разовой дозе","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["От 1мг-0.2мл До 2.5мг-0.5мл"],10:["От 2мг-0.4мл До 5мг-1мл"],15:["От 3мг-0.6мл До 7.5мг-1.5мл"],20:["От 4мг-0.8мл До 10мг-2мл"],25:["От 5мг-1мл До 10мг-2мл"],30:["От 6мг-1.2мл До 10мг-2мл"],35:["От 7мг-1.4мл До 10мг-2мл"],40:["От 8мг-1.6мл До 10мг-2мл"],45:["От 9мг-1.8мл До 10мг-2мл"],50:["10мг-2мл"],}},

   Димедрол:{
name:"Димедрол",synonyms:["Дифенгидрамин","dimedrol"],type:"age",unit:"возраст в годах",steps:[0.7,1,2,3,4,5,6,7,8,9,10,11,12,13,14],info:["<b>Название:</b>"," Дифенгидрамин; Димедрол","Ампула 10 мг/мл-1 мл","<b>Дозировка введения:</b>","Внутривенно; Внутримышечно","с 7-12 месяцев 5мг - 0,5мл","1-3 года 5-10мг - 0,5-1,0мл","С 4 лет не более 10мг-1 мл","<b>Максимальная дозировка:</b>","Суточная доза","Старше 14 лет - 150 мг","<b>Возрастные ограничения:</b>","Старше 7 месяцев"],
table:{0.7:["5мг - 0,5мл"],1:["5-10мг - 0,5-1,0мл"],2:["5-10мг - 0,5-1,0мл"],3:["5-10мг - 0,5-1,0мл"],4:["10мг-1 мл"],5:["10мг-1 мл"],6:["10мг-1 мл"],7:["10мг-1 мл"],8:["10мг-1 мл"],9:["10мг-1 мл"],10:["10мг-1 мл"],11:["10мг-1 мл"],12:["10мг-1 мл"],13:["10мг-1 мл"],14:["10мг-1 мл"],}},

   Допамин:{
name:"Допамин",synonyms:["дофамин","dopamin","dofamin"],type:"weight",unit:"вес в кг",steps:[2.5,5,10,15,20,25,30,35,40,45],info:["<b>Название:</b>","Допамин","Ампула 40мг/мл-5мл","<b>Дозировка введения:</b>","Инфузионно в/венно","5-25 мкг/кг/мин","Инфузия шприцевым дозатором с использованием шприца 20 мл","Допамин 40мг-1мл в разведении раствором Натрия хлорида 0.9% до 20 мл ","Скорость в мл/час, устанавливается в дозаторе","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{2.5:["0.2 мл/час (5 мкг/кг/мин)","0.4 мл/час (10 мкг/кг/мин)" ,"0.6 мл/час (15 мкг/кг/мин)" ,"0.8 мл/час (20мкг/кг/мин)" ,"1.1 мл/час (25 мкг/кг/мин)"],5:["0.4 мл/час (5 мкг/кг/мин)","0.8 мл/час (10 мкг/кг/мин)" ,"1.1 мл/час (15 мкг/кг/мин)" ,"1.5 мл/час (20мкг/кг/мин)" ,"2.3 мл/час (25 мкг/кг/мин)"],10:["0.8 мл/час (5 мкг/кг/мин)","1.5 мл/час (10 мкг/кг/мин)" ,"2.3 мл/час (15 мкг/кг/мин)" ,"3 мл/час (20мкг/кг/мин)" ,"4.5 мл/час (25 мкг/кг/мин)"],15:["1.1 мл/час (5 мкг/кг/мин)","2.3 мл/час (10 мкг/кг/мин)" ,"3.4 мл/час (15 мкг/кг/мин)" ,"4.5 мл/час (20мкг/кг/мин)" ,"6.8 мл/час (25 мкг/кг/мин)"],20:["1.5 мл/час (5 мкг/кг/мин)","3 мл/час (10 мкг/кг/мин)" ,"4.5 мл/час (15 мкг/кг/мин)" ,"6 мл/час (20мкг/кг/мин)" ,"9 мл/час (25 мкг/кг/мин)"],25:["1.9 мл/час (5 мкг/кг/мин)","3.8 мл/час (10 мкг/кг/мин)" ,"5.6 мл/час (15 мкг/кг/мин)" ,"7.5 мл/час (20мкг/кг/мин)" ,"11.3 мл/час (25 мкг/кг/мин)"],30:["2.3 мл/час (5 мкг/кг/мин)","4.5 мл/час (10 мкг/кг/мин)" ,"6.8 мл/час (15 мкг/кг/мин)" ,"9 мл/час (20мкг/кг/мин)" ,"13.5 мл/час (25 мкг/кг/мин)"],35:["2.6 мл/час (5 мкг/кг/мин)","5.3 мл/час (10 мкг/кг/мин)" ,"7.9 мл/час (15 мкг/кг/мин)" ,"10.5 мл/час (20мкг/кг/мин)" ,"15.8 мл/час (25 мкг/кг/мин)"],40:["3 мл/час (5 мкг/кг/мин)","6 мл/час (10 мкг/кг/мин)" ,"9 мл/час (15 мкг/кг/мин)" ,"12 мл/час (20мкг/кг/мин)" ,"18 мл/час (25 мкг/кг/мин)"],45:["3.4 мл/час (5 мкг/кг/мин)","6.8 мл/час (10 мкг/кг/мин)" ,"10.1 мл/час (15 мкг/кг/мин)" ,"13.5 мл/час (20мкг/кг/мин)" ,"20.3 мл/час (25 мкг/кг/мин)"],}},

   Унитиол:{
name:"Унитиол",synonyms:["Димеркаптопроп ансульфонат","unitiol"],type:"weight",unit:"вес в кг",steps:[5,10,15,20,25,30,35,40,45,50],info:["<b>Название:</b>","Димеркаптопроп ансульфонат натрия;","Унитиол","Ампула 50мг/мл-5мл","<b>Дозировка введения:</b>","Внутримышечно; подкожно","0,1 мл/кг","<b>Возрастные ограничения:</b>","Возрастных ограничений нет"],
table:{5:["0.5мл"],10:["1мл"],15:["1.5мл"],20:["2мл"],25:["2.5мл"],30:["3мл"],35:["3.5мл"],40:["4мл"],45:["4.5мл"],50:["5мл"],}},
   
   ПоследнийПример:{
        name:"Последний",
        synonyms:["Натрий"],
        type:"text",
        info:["0.02 мг/кг","не более 0.6 мг за раз","в/в или в/м"],}
};

// Калькулятор препаратов
const $ = id => document.getElementById(id);

const drugSearch = $("drugSearch");
const drugList = $("drugList");
const drugParam = $("drugParam");
const drugInfo = $("drugInfo");
const drugResult = $("drugResult");
const btnToggle = $("drugListToggle");

let selectedKey = null;

// ========== показать весь список ==========
btnToggle.onclick = () => {
    drugList.innerHTML = "";
    Object.entries(DRUGS).forEach(([key,data]) => {
        drugList.innerHTML += `<option value="${key}">${data.name}</option>`;
    });
    drugList.style.display = "block";
};

// ========== поиск без enter ==========
drugSearch.addEventListener("input", () => {
    const q = drugSearch.value.trim().toLowerCase();
    resetCalc();
    if(!q){
        drugList.style.display = "none";
        return;
    }
    drugList.innerHTML = "";
    drugList.style.display = "block";
    Object.entries(DRUGS).forEach(([key,data]) => {
        if(data.name.toLowerCase().includes(q) ||
           data.synonyms.some(n => n.toLowerCase().includes(q))
        ){
            drugList.innerHTML += `<option value="${key}">${data.name}</option>`;
        }
    });
});

// ========== выбор препарата ==========
drugList.addEventListener("change", () => {
    resetCalc();
    selectedKey = drugList.value;
    const drug = DRUGS[selectedKey];
    drugSearch.value = drug.name;
    drugList.style.display = "none";
    showInfo(drug);
    if(drug.type === "text") return;
    fillParams(drug);
});

btnToggle.addEventListener("click", () => {
    resetCalc();
});

// ========== отображаем справку ==========
function showInfo(drug){
    drugInfo.innerHTML = drug.info.join("<br>");
    drugInfo.style.display = "block";
}

// ========== вывод вариантов веса/возраста ==========
function fillParams(drug){
    drugParam.innerHTML = "";
    drugParam.style.display = "block";
    const label = `Выберите ${drug.unit}`;
    drugParam.innerHTML += `<option value="">${label}</option>`;
    drug.steps.forEach(v => {
        drugParam.innerHTML += `<option value="${v}">${v}</option>`;
    });
}

// ========== выбор параметра (вес/возраст) ==========
drugParam.addEventListener("change", () => {
    if(!selectedKey) return;
    const drug = DRUGS[selectedKey];
    const v = drugParam.value;
    const row = drug.table[v];
    if(!row) return;
    drugResult.innerHTML = row.join("<br>");
    drugResult.style.display = "block";
});

// ========== очистка ==========
function resetCalc(){
    selectedKey = null;
    drugParam.style.display = "none";
    drugParam.innerHTML = "";
    drugInfo.style.display = "none";
    drugInfo.innerHTML = "";
    drugResult.style.display = "none";
    drugResult.innerHTML = "";
}

drugSearch.addEventListener("input", () => {
    if(!drugSearch.value.trim()) resetCalc();
});
