// Создаем массив кнопок и текста
const НеврологияTemplates = [
       
{ text: "Алкогольная полиневропатия", modal: `тут текст` },
{ text: "Блефароспазм", modal: `текст` },
{ text: "Болезнь Паркинсона", modal: `текст` },
{ text: "Синдром вертебробазилярной артериальной системы (ВБН)", modal: `текст` },
{ text: "Расстройство вегетативной нервной системы (ВСД)", modal: `текст` },
{ text: "Головная боль", modal: `текст` },
{ text: "Дорсалгия грудного отдела позвоночника", modal: `текст` },
{ text: "Дисциркуляторная энцефалопатия (ДЭП)", modal: `текст` },
{ text: "Дисциркуляторная энцефалопатия (ДЭП). Угнетение сознания", modal: `текст` },
{ text: "Ишиас", modal: `текст` },
{ text: "Люмбалгия", modal: `текст` },
{ text: "Люмбоишиалгия", modal: `текст` },
{ text: "Миастенический криз", modal: `текст` },
{ text: "Мигрень", modal: `текст` },
{ text: "Миозит", modal: `текст` },
{ text: "Невралгия тройничного нерва", modal: `текст` },
{ text: "Острое нарушение мозгового кровообращения (ОНМК) (Инсульт)", modal: `текст` },
{ text: "Паралич Белла", modal: `текст` },
{ text: "Паралич Тодда", modal: `текст` },
{ text: "Радикулопатия с нарушением чувствительности", modal: `текст` },
{ text: "Рассеянный склероз", modal: `текст` },
{ text: "Состояние после обморока", modal: `текст` },
{ text: "Состояние после стресса", modal: `текст` },
{ text: "Состояние после судорог", modal: `текст` },
{ text: "Субарахноидальное кровоизлияние (САК)", modal: `текст` },
{ text: "Транзиторная ишемическая атака (ТИА)", modal: `текст` },
{ text: "Цервикалгия", modal: `текст` },
{ text: "Эпилепсия. Серия судорог", modal: `текст` }];


// Создаем кнопки после загрузки DOM
document.addEventListener("DOMContentLoaded", () => {
    const container = document.getElementById("Неврология");

    if (!container) {
        console.error("Container #Неврология не найден.");
        return;
    }

    НеврологияTemplates.forEach(item => {
        const btn = document.createElement("button");
        btn.className = "child-btn";
        btn.textContent = item.text;
        btn.onclick = () => openModal(item.modal);
        container.appendChild(btn);
    });
});
