// Создаем массив кнопок и текста
const ТравматологияTemplates = [
       
{ text: "Ампутация конечности", modal: `тут текст` },
{ text: "Ампутация пальца", modal: `текст` },
{ text: "Ампутация уха", modal: `текст` },
{ text: "Вывих бедра", modal: `текст` },
{ text: "Вывих кисти", modal: `текст` },
{ text: "Вывих ключицы", modal: `текст` },
{ text: "Вывих локтя", modal: `текст` },
{ text: "Вывих надколенника", modal: `текст` },
{ text: "Вывих пальца", modal: `текст` },
{ text: "Вывих плеча", modal: `текст` },
{ text: "Вывих стопы", modal: `текст` },
{ text: "Вывих челюсти", modal: `текст` },
{ text: "Вывих шейного позвонка", modal: `текст` },
{ text: "Закрытая травма живота", modal: `текст` },
{ text: "Закрытая черепно-мозговая травма. Сотрясение головного мозга (ЗЧМТ. СГМ)", modal: `текст` },
{ text: "Инородное тело влагалища", modal: `текст` },
{ text: "Инородное тело глаза", modal: `текст` },
{ text: "Инородное тело глотки", modal: `текст` },
{ text: "Инородное тело дыхательных путей", modal: `текст` },
{ text: "Инородное тело желудка", modal: `текст` },
{ text: "Инородное тело носа", modal: `текст` },
{ text: "Инородное тело прямой кишки", modal: `текст` },
{ text: "Инородное тело уретры", modal: `текст` },
{ text: "Инородное тело уха", modal: `текст` },
{ text: "Колотая рана", modal: `текст` },
{ text: "Кровотечение из наружного слухового прохода", modal: `текst` },
{ text: "Огнестрельная рана", modal: `текст` },
{ text: "Ожог", modal: `текст` },
{ text: "Ожог инфицированный", modal: `текст` },
{ text: "Отморожение", modal: `текст` },
{ text: "Параорбитальная гематома", modal: `текст` },
{ text: "Перелом бедра", modal: `текст` },
{ text: "Перелом голени", modal: `текст` },
{ text: "Перелом грудины", modal: `текст` },
{ text: "Перелом ключицы", modal: `текст` },
{ text: "Перелом копчика", modal: `текст` },
{ text: "Перелом обеих лодыжек с подвывихом", modal: `текст` },
{ text: "Перелом внутренней лодыжки", modal: `текст` },
{ text: "Перелом наружной лодыжки", modal: `текст` },
{ text: "Перелом наружной лодыжки с подвывихом", modal: `текст` },
{ text: "Перелом локтевой кости", modal: `текст` },
{ text: "Перелом лопатки", modal: `текст` },
{ text: "Перелом лучевой кости", modal: `текст` },
{ text: "Перелом надколенника", modal: `текст` },
{ text: "Перелом носа", modal: `текст` },
{ text: "Перелом нижней челюсти", modal: `текст` },
{ text: "Перелом открытый", modal: `текст` },
{ text: "Перелом пальца", modal: `текст` },
{ text: "Перелом плеча", modal: `текст` },
{ text: "Перелом позвоночника", modal: `текст` },
{ text: "Перелом предплечья", modal: `текст` },
{ text: "Перелом пястной кости", modal: `текст` },
{ text: "Перелом ребра/ребер", modal: `текст` },
{ text: "Перелом свода черепа", modal: `текст` },
{ text: "Перелом скуловой кости", modal: `текст` },
{ text: "Перелом таза", modal: `текст` },
{ text: "Перелом шейки бедра", modal: `текст` },
{ text: "Перелом шейки плеча", modal: `текст` },
{ text: "Разрыв сухожилия плеча", modal: `текст` },
{ text: "Рана пальца без повреждения ногтевой пластины", modal: `текст` },
{ text: "Рана пальца с повреждением ногтевой пластины", modal: `текст` },
{ text: "Растяжение связок", modal: `текст` },
{ text: "Резаная рана", modal: `текст` },
{ text: "Скальпированная рана", modal: `текст` },
{ text: "Ссадина", modal: `текст` },
{ text: "Травматический разрыв барабанной перепонки", modal: `текст` },
{ text: "Укус змеи", modal: `текст` },
{ text: "Укус клеща", modal: `текст` },
{ text: "Укус насекомого", modal: `текст` },
{ text: "Укусы клопов", modal: `текст` },
{ text: "Укушенная рана", modal: `текст` },
{ text: "Укушенная рана языка", modal: `текст` },
{ text: "Ушиб глазного яблока", modal: `текст` },
{ text: "Ушиб мягких тканей (гематома)", modal: `текст` },
{ text: "Ушиб коленного сустава. Гемартроз", modal: `текст` },
{ text: "Ушибленная рана", modal: `текст` },
{ text: "Химический ожог глаз", modal: `текст` },
{ text: "Эвентрация", modal: `текст` }];


// Создаем кнопки после загрузки DOM
document.addEventListener("DOMContentLoaded", () => {
    const container = document.getElementById("Травматология");

    if (!container) {
        console.error("Container #Травматология не найден.");
        return;
    }

    ТравматологияTemplates.forEach(item => {
        const btn = document.createElement("button");
        btn.className = "child-btn";
        btn.textContent = item.text;
        btn.onclick = () => openModal(item.modal);
        container.appendChild(btn);
    });
});
